[  
  {
    "categoria": "Ensino",
    "pergunta": "Como você avalia a didática das disciplinas assistidas no período avaliado?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Ensino",
    "pergunta": "A comunicação entre os professores e os alunos têm sido adequadas?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Ensino",
    "pergunta": "Você sente que os colegas de turma se comunicam de maneira efetiva durante as aulas e atividades acadêmicas?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Ensino",
    "pergunta": "Quais estratégias você considera mais eficientes para o seu aprendizado?",
    "caixa_de_texto": true
  },
  {
    "categoria": "Ensino",
    "pergunta": "Em relação a motivação dos professores, como você avaliaria a disciplina DISCIPLINA 1?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Ensino",
    "pergunta": "Em relação a motivação dos professores, como você avaliaria a disciplina DISCIPLINA 2?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Ensino",
    "pergunta": "Em relação a motivação dos professores, como você avaliaria a disciplina DISCIPLINA 3?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Ensino",
    "pergunta": "Quais recursos adicionais (como materiais complementares, tutoriais, etc.) têm sido úteis para o seu aprendizado?",
    "caixa_de_texto": true
  },
  {
    "categoria": "Ensino",
    "pergunta": "Você acredita que as avaliações (provas, trabalhos e outros) aplicadas são justas e coerentes com os conteúdos ministrados?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Ensino",
    "pergunta": "Você sente que há espaço para a expressão de suas dúvidas e opiniões durante as aulas?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Ensino",
    "pergunta": "Como você avalia a interação entre os alunos e os professores fora do horário das aulas?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Ensino",
    "pergunta": "Quais sugestões você teria para melhorar a qualidade do ensino na Faculdade de Computação?",
    "caixa_de_texto": true
  },
  {
    "categoria": "Pesquisa",
    "pergunta": "Você tem conhecimento das pesquisas que acontecem dentro da Faculdade de Computação?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Pesquisa",
    "pergunta": "Alguma vez você sentiu-se motivado a procurar um professor ou laboratório para iniciar uma pesquisa?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Pesquisa",
    "pergunta": "Você tem noção como um estágio em um laboratório de pesquisa pode evoluir para um trabalho de conclusão de curso (TCC)?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Pesquisa",
    "pergunta": "Você tem conhecimento de que os laboratórios de pesquisa abordam temas atuais, tanto em âmbito mundial quanto em relação à região amazônica?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Pesquisa",
    "pergunta": "Você já teve interesse em saber mais sobre algum projeto de pesquisa em específico?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Pesquisa",
    "pergunta": "Você tem interesse em participar de algum projeto de pesquisa na Faculdade de Computação?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Extensão",
    "pergunta": "17. Quantos projetos de extensão você conhece que ocorrem na Faculdade de Computação?",
    "caixa_de_texto": true
  },
  {
    "categoria": "Extensão",
    "pergunta": "Você tem ciência de que a maioria dos projetos de extensão são interdisciplinares e envolvem a comunidade, instituições públicas, privadas e terceiro setor?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Extensão",
    "pergunta": "Você já demonstrou interesse em obter mais informações sobre algum projeto de extensão específico?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Extensão",
    "pergunta": "Você tem interesse em participar de um projeto de extensão na Faculdade de Computação?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Extensão",
    "pergunta": "Você acredita que a participação em projetos de extensão pode contribuir para o seu desenvolvimento acadêmico e profissional?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Extensão",
    "pergunta": "Você considera importante a relação entre a universidade e a comunidade por meio dos projetos de extensão?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Administração",
    "pergunta": "A comunicação pessoal, redes sociais e e-mail da administração são eficazes para transmitir informações importantes?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Administração",
    "pergunta": "Você sente que a Faculdade compreende suas necessidades e expectativas como aluno?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Administração",
    "pergunta": "Você acredita que a administração está realizando um planejamento adequado para atender às demandas dos alunos?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Administração",
    "pergunta": "Como você avalia a eficiência dos processos administrativos na Faculdade de Computação?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Administração",
    "pergunta": "Você acredita que a administração está fazendo o melhor possível para promover um ambiente acadêmico favorável?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Administração",
    "pergunta": "Sobre o visual das publicações, você considera criativos?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Administração",
    "pergunta": "Como você sugere que a administração pode melhorar seus serviços e atendimento aos alunos?",
    "caixa_de_texto": true
  },
  {
    "categoria": "Administração",
    "pergunta": "Existe alguma reclamação específica ou problema que você gostaria de relatar em relação à administração?",
    "caixa_de_texto": true
  },
  {
    "categoria": "Estrutura",
    "pergunta": "Como você avalia a qualidade dos computadores nos laboratórios da Faculdade de Computação?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Estrutura",
    "pergunta": "Os programas instalados nos computadores dos laboratórios atendem às suas necessidades acadêmicas?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Estrutura",
    "pergunta": "Você considera os laboratórios de ensino a Faculdade de Computação confortáveis em termos de climatização, iluminação e mobiliário?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Estrutura",
    "pergunta": "Como você avalia a limpeza e organização dos laboratórios da Faculdade de Computação?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Extra",
    "pergunta": "Você sente que tem acesso adequado aos professores para tirar dúvidas fora do horário das aulas ou por meio de e-mail?",
    "caixa_de_texto": false
  },
  {
    "categoria": "Extra",
    "pergunta": "Você gostaria de fazer alguma sugestão adicional ou expressar alguma reclamação sobre a Faculdade de Computação?",
    "caixa_de_texto": true
  },
  {
    "categoria": "Extra",
    "pergunta": "Existe algum ponto que não foi abordado nas perguntas anteriores que você gostaria de comentar sobre a sua experiência na Faculdade de Computação?",
    "caixa_de_texto": true
  }
]